[
  "Enhanced editing",
  "table-editor-obsidian",
  "table-extended",
  "better-word-count",
  "obsidian-checklist-plugin",
  "calendar",
  "cmenu-plugin",
  "obsidian-copy-block-link",
  "dataview",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-emoji-toolbar",
  "obsidian-enhancing-mindmap",
  "folder-note-plugin",
  "obsidian-icon-folder",
  "obsidian-kanban",
  "obsidian-tracker",
  "obsidian-timelines",
  "obsidian-task-collector",
  "tag-wrangler",
  "tag-page-preview",
  "obsidian-style-settings",
  "sliding-panes-obsidian",
  "recent-files-obsidian",
  "readwise-official",
  "quick-explorer",
  "obsidian-plotly",
  "url-into-selection",
  "obsidian-pandoc",
  "oz-image-plugin",
  "obsidian-outliner",
  "obsidian-tabs",
  "obsidian-git",
  "obsidian-charts",
  "note-refactor-obsidian",
  "note-folder-autorename",
  "nldates-obsidian",
  "maximise-active-pane-obsidian",
  "markdown-prettifier",
  "obsidian-admonition",
  "obsidian-advanced-new-file",
  "obsidian-dictionary-plugin",
  "obsidian-mind-map",
  "obsidian-better-command-palette",
  "obsidian-tasks-plugin",
  "obsidian-annotator"
]