[
  "Enhanced editing",
  "table-editor-obsidian",
  "table-extended",
  "better-word-count",
  "obsidian-checklist-plugin",
  "calendar",
  "cmenu-plugin",
  "obsidian-copy-block-link",
  "dataview",
  "obsidian-day-planner",
  "DEVONlink-obsidian",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-emoji-toolbar",
  "obsidian-enhancing-mindmap",
  "folder-note-plugin",
  "obsidian-hackernews",
  "obsidian-icon-folder",
  "obsidian-kanban",
  "leader-hotkeys-obsidian",
  "longform",
  "obsidian-tracker",
  "obsidian-timelines",
  "templater-obsidian",
  "obsidian-task-collector",
  "tag-wrangler",
  "tag-page-preview",
  "obsidian-style-settings",
  "smart-random-note",
  "sliding-panes-obsidian",
  "rss-reader",
  "recent-files-obsidian",
  "readwise-official",
  "quick-explorer",
  "obsidian-plotly",
  "url-into-selection",
  "obsidian-pandoc",
  "oz-image-plugin",
  "obsidian-outliner",
  "obsidian-tabs"
]