[
  "obsidian-git",
  "obsidian-kanban",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-checklist-plugin",
  "calendar",
  "table-editor-obsidian",
  "obsidian-day-planner",
  "nldates-obsidian",
  "tag-wrangler",
  "smart-random-note",
  "obsidian-excalidraw-plugin",
  "better-word-count",
  "obsidian-emoji-toolbar",
  "markdown-prettifier",
  "obsidian-dictionary-plugin",
  "obsidian-tracker",
  "leader-hotkeys-obsidian",
  "obsidian-charts",
  "obsidian-icon-folder",
  "obsidian-style-settings",
  "templater-obsidian",
  "rss-reader",
  "obsidian-advanced-new-file",
  "tag-page-preview",
  "recent-files-obsidian",
  "dataview",
  "maximise-active-pane-obsidian"
]